#+name: N4BI Services Graph
#+author: Carsten Fortmann-Grote (github:@CFGrote)
#+dateCreated: 20250626

* Introduction
:PROPERTIES:
:ID:       3aaf0468-5036-4bb4-85e2-8b567db52dbb
:END:
This document adds digital services provided or otherwise related to the NFDI4BIOIMAGE consortium such
as databases, websites, knowledge graphs.

* OMERO Instances
:PROPERTIES:
:ID:       6b1ca646-bae3-4347-8385-33de2ea0ef86
:header-args:rdf: :noweb no-export :tangle ../RDF_dumps/n4bi_services.n3
:END:

#+name: n4bi_services.skeleton
#+begin_src rdf
  <<prefixes>>

  <<statements>>
#+end_src


** Prefixes
:PROPERTIES:
:ID:       facc66e8-f32c-4c9b-878f-0518c999ee77
:END:
#+begin_src rdf :noweb-ref prefixes
PREFIX dc:       <http://purl.org/dc/elements/1.1/>
PREFIX foaf:     <http://xmlns.com/foaf/0.1/>
PREFIX nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/>
PREFIX rdfs:     <http://www.w3.org/2000/01/rdf-schema#>
PREFIX sio:      <http://semanticscience.org/resource/>
PREFIX xsd:      <http://www.w3.org/2001/XMLSchema#>
PREFIX zenodo:   <https://zenodo.org/ns/>
PREFIX t4fs:     <http://purl.obolibrary.org/obo/T4FS_>
#+end_src

** Statements
:PROPERTIES:
:ID:       704a7f5c-a99c-4c15-8fd8-bc9f566bd114
:END:

*** OMERO-NFDI
:PROPERTIES:
:ID:       7e1c6594-643a-4655-8b69-85da5c0bf6fb
:END:

Our first OMERO instance to add in the public "all plugins" instance https://omero-nfdi.uni-muenster.de. 
We define this instance as a Database (to be reconsidered but should be ok for a start).
#+begin_src rdf :noweb-ref statements
  <https://omero-nfdi.uni-muenster.de> a t4fs:0000397 , <https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001> .
  <https://evolomero.evolbio.mpg.de> a t4fs:0000397 , <https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001> .
#+end_src

**** Adding properties
:PROPERTIES:
:ID:       c30b9baa-60f4-4638-8b73-69ea5a2d2246
:END:
By adding the SPARQL endpoint of this omero instance, we make it part of the n4bi knowledge graph system.
#+begin_src rdf :noweb-ref statements
  <https://omero-nfdi.uni-muenster.de> nfdicore:NFDI_0000201 <https://omero-nfdi.uni-muenster.de/vkg/sparql> .
  <https://evolomero.evolbio.mpg.de> nfdicore:NFDI_0000201 <https://evolomero.evolbio.mpg.de/vkg/sparql> .
#+end_src


*** Adding wikidata properties and types
:PROPERTIES:
:ID:       f3f884c6-bdb6-46c3-8ea1-50de2deb2459
:END:
First, I did not find a class for Knowledge Graph but actually wikidata has one: [[https://www.wikidata.org/wiki/Q33002955][=wd:Q33002955=]].

#+begin_src rdf :noweb-ref statements
 <https://omero-nfdi.uni-muenster.de/vkg/sparql> a wd:Q33002955 .
 <https://evolomero.evolbio.mpg.de/vkg/sparql> a wd:Q33002955 .

#+end_src
I'll also add a relation between the NFDI4BIOIMAGE consortium and the Münster public OMERO. [[http://www.wikidata.org/prop/P121][wp:P121]] is labelled "item operated".
 #+begin_src rdf :noweb-ref statements
 <https://nfdi4bioimage.de/rdf/node> wdt:P121 <https://omero-nfdi.uni-muenster.de> .
 #+end_src

and the prefixes
#+begin_src rdf :noweb-ref prefixes
  prefix wd: <http://www.wikidata.org/entity/>
  prefix wdt: <http://www.wikidata.org/prop/direct/>
#+end_src

* clean up
:PROPERTIES:
:ID:       21be22b1-1c18-405d-a5e6-eaa004f7f37e
:END:

#+begin_src shell :dir ../RDF_dumps/ :results output
    export PATH=/opt/apache-jena/bin:$PATH
    cat n4bi_services.n3 | sed 's/^-\{2,\}.*$//' > tmp.n3
    riot --output=n3 tmp.n3 > n4bi_services.n3
#+end_src

#+RESULTS:

* Updates [2026-06-04 Thu]
:PROPERTIES:
:ID:       3113f4c3-d48d-466c-b2ec-9f890406989a
:END:

** More OMERO instances
:PROPERTIES:
:ID:       ded2089c-29c6-4ca6-a0f5-c859809c082e
:END:
see [[https://nfdi4bioimage.de/en/services/omero-services/]]

- Evaluate this INSERT DATA query in the online frontend
#+begin_src sparql :url http://kg.nfdi4bioimage.de/#/datasets/N4BiKG/update :eval no
   PREFIX dc:       <http://purl.org/dc/elements/1.1/>
   PREFIX foaf:     <http://xmlns.com/foaf/0.1/>
   PREFIX nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/>
   PREFIX rdfs:     <http://www.w3.org/2000/01/rdf-schema#>
   PREFIX sio:      <http://semanticscience.org/resource/>
   PREFIX xsd:      <http://www.w3.org/2001/XMLSchema#>
   PREFIX zenodo:   <https://zenodo.org/ns/>
   PREFIX t4fs:     <http://purl.obolibrary.org/obo/T4FS_>

   insert data {
       GRAPH <https://kg.nfdi4bioimage.de/n4bikg/services> {
         <https://omero-training.gerbi-gmb.de/> a t4fs:0000397 ,
                                                  <https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 ;
         ^wdt:P121 <https://nfdi4bioimage.de/rdf/node> ;
         rdfs:comment "The OMERO Training Instance is intended for researchers, trainers, and community members who require an OMERO instance for
  workshops, demonstrations, training sessions, or presentations. It provides a ready-to-use environment that supports hands-on learning and
  the practical exploration of image data management workflows.
  Bonus: you can visit this instance and explore the features of OMERO playfully by going on a treasure hunt.
  If you want to use the OMERO Training Instance for your courses, please contact our HelpDesk." .
        <https://omero-nfdi.uni-muenster.de> rdfs:comment "The Rich OMERO Playground Instance is designed for advanced users, developers, and OMERO administrators who want to test plugins and
 scripts in a standardized, community-run environment. As a non-production instance built by the community for the community, it serves as
 a safe playground for experimentation and development. Developers can request admin-level access to the OMERO server and SSH access
 to the underlying system. To get started, please contact us via the HelpDesk." .
       }
   }
#+end_src
- TiM OMERO
#+begin_src sparql :url http://kg.nfdi4bioimage.de/#/datasets/N4BiKG/update :eval no
  PREFIX t4fs: <http://purl.obolibrary.org/obo/T4FS_>
  PREFIX wdt:  <http://www.wikidata.org/prop/direct/>
  PREFIX rdfs:     <http://www.w3.org/2000/01/rdf-schema#>

  INSERT DATA {
    GRAPH <https://kg.nfdi4bioimage.de/n4bikg/services> {
      <https://omero-tim.gerbi-gmb.de> a t4fs:0000397 ,
                                         <https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001> ;
      rdfs:comment """The Trends-in-Microscopy (TiM) OMERO Instance is a comprehensive collection of extensively annotated bioimaging datasets acquired using a wide range of microscopy technologies during the biannual TiM community meetings organized by German BioImaging. The datasets have been collaboratively collected, annotated, and curated in accordance with the Recommended Metadata for Biological Images (REMBI) standard. The platform provides a practical example of structured bioimage data management and standardized metadata annotation in biological microscopy. If you are new to OMERO and would like to explore its interface and capabilities, we encourage you to browse the TiM OMERO Instance.""" .
      <https://nfdi4bioimage.de/rdf/node> wdt:P121 <https://omero-tim.gerbi-gmb.de> .
    }
  }
#+end_src

*** All triples in the services graph
:PROPERTIES:
:ID:       1a88a31a-489b-441f-8f7e-289cc8c13ee5
:END:
#+begin_src sparql :url http://kg.nfdi4bioimage.de/N4BIKG/query
  select * where {
    GRAPH <https://kg.nfdi4bioimage.de/n4bikg/services> {?s ?p ?o}
  }

#+end_src

#+RESULTS:
| s                                           | p                                               | o                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |
|---------------------------------------------+-------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| https://nfdi4bioimage.de/rdf/node           | http://www.wikidata.org/prop/direct/P121        | https://omero-training.gerbi-gmb.de/                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| https://nfdi4bioimage.de/rdf/node           | http://www.wikidata.org/prop/direct/P121        | https://omero-tim.gerbi-gmb.de                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| https://nfdi4bioimage.de/rdf/node           | http://www.wikidata.org/prop/direct/P121        | https://omero.nfdi4bioimage.de                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| https://evolomero.evolbio.mpg.de/vkg/sparql | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.wikidata.org/entity/Q33002955                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |
| https://evolomero.evolbio.mpg.de            | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| https://evolomero.evolbio.mpg.de            | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
| https://evolomero.evolbio.mpg.de            | http://www.w3.org/2000/01/rdf-schema#comment    | EvolOMERO is the public OMERO instance at the MPI for Evolutionary Biology. It hosts datasets underlying publications authored by MPI affiliates and other, unpublished data to facilitate sharing with non-MPI collaborators.                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| https://evolomero.evolbio.mpg.de            | http://www.w3.org/ns/dcat#accesURL              | https://evolomero.evolbio.mpg.de/vkg/sparql                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
| https://omero-training.gerbi-gmb.de/        | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| https://omero-training.gerbi-gmb.de/        | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
| https://omero-training.gerbi-gmb.de/        | http://www.w3.org/2000/01/rdf-schema#comment    | The OMERO Training Instance is intended for researchers, trainers, and community members who require an OMERO instance for workshops, demonstrations, training sessions, or presentations. It provides a ready-to-use environment that supports hands-on learning and  the practical exploration of image data management workflows.  Bonus: you can visit this instance and explore the features of OMERO playfully by going on a treasure hunt.  If you want to use the OMERO Training Instance for your courses, please contact our HelpDesk.                                                                                                                                                             |
| https://omero-tim.gerbi-gmb.de              | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| https://omero-tim.gerbi-gmb.de              | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
| https://omero-tim.gerbi-gmb.de              | http://www.w3.org/2000/01/rdf-schema#comment    | The Trends-in-Microscopy (TiM) OMERO Instance is a comprehensive collection of extensively annotated bioimaging datasets acquired using a wide range of microscopy technologies during the biannual TiM community meetings organized by German BioImaging. The datasets have been collaboratively collected, annotated, and curated in accordance with the Recommended Metadata for Biological Images (REMBI) standard. The platform provides a practical example of structured bioimage data management and standardized metadata annotation in biological microscopy. If you are new to OMERO and would like to explore its interface and capabilities, we encourage you to browse the TiM OMERO Instance. |
| https://omero.nfdi4bioimage.de              | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| https://omero.nfdi4bioimage.de              | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
| https://omero.nfdi4bioimage.de              | http://www.w3.org/2000/01/rdf-schema#comment    | The Rich OMERO Playground Instance is designed for advanced users, developers, and OMERO administrators who want to test plugins and scripts in a standardized, community-run environment. As a non-production instance built by the community for the community, it serves as a safe playground for experimentation and development. Developers can request admin-level access to the OMERO server and SSH access to the underlying system.                                                                                                                                                                                                                                                                 |
| https://omero.nfdi4bioimage.de              | http://www.w3.org/ns/dcat#accesURL              | https://omero.nfdi4bioimage.de/vkg/sparql                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| https://omero.nfdi4bioimage.de/vkg/sparql   | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.wikidata.org/entity/Q33002955                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |
| https://omero-training.gerbi-gmb.de         | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |


*** DONE omero-nfdi.uni-muenster.de has become omero.nfdi4bioimage.de [2/2]
CLOSED: [2026-06-05 Fri 22:17]
:PROPERTIES:
:ID:       972459e6-79ce-4c45-8484-02421fa831e5
:END:


**** DONE Re-deploy with accurate namespace/prefix
CLOSED: [2026-06-05 Fri 15:37]
:PROPERTIES:
:ID:       0d9dce94-c9fa-45bb-a7ea-27771a887e64
:END:



**** DONE Correct urls in services graph
CLOSED: [2026-06-05 Fri 22:17]
:PROPERTIES:
:ID:       3a55c2fa-a59b-49bc-b074-fbd847afeaf0
:END:

#+begin_src sparql :noweb-ref prefixes
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  prefix dcite: <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
  prefix nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/>
  prefix zenodocomm: <https://zenodo.org/communities/>
  prefix sio: <http://semanticscience.org/resource/>
  prefix n4bikg: <https://kg.nfdi4bioimage.de/n4bikg/>
  prefix dcat: <http://www.w3.org/ns/dcat#>
#+end_src

***** Find all triples in services graph
:PROPERTIES:
:ID:       037d8cd9-701c-47e7-a16f-765d3e05146d
:END:
#+begin_src sparql :url http://kg.nfdi4bioimage.de/N4BIKG/sparql :noweb yes
  <<prefixes>>

  select ?s ?new_s ?o ?new_o where {
    graph n4bikg:services {?s ?p ?o .}
    bind(iri(replace(str(?s), "^https://omero-nfdi.uni-muenster.de", "https://omero.nfdi4bioimage.de")) as ?new_s)
    bind(iri(replace(str(?o), "^https://omero-nfdi.uni-muenster.de", "https://omero.nfdi4bioimage.de")) as ?new_o)
    }
#+end_src

#+RESULTS:
| s                                             | new_s                                       | o                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            | new_o                                               |
|-----------------------------------------------+---------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------------------------------|
| https://nfdi4bioimage.de/rdf/node             | https://nfdi4bioimage.de/rdf/node           | https://omero-nfdi.uni-muenster.de                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           | https://omero.nfdi4bioimage.de                      |
| https://nfdi4bioimage.de/rdf/node             | https://nfdi4bioimage.de/rdf/node           | https://omero-training.gerbi-gmb.de/                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         | https://omero-training.gerbi-gmb.de/                |
| https://nfdi4bioimage.de/rdf/node             | https://nfdi4bioimage.de/rdf/node           | https://omero-tim.gerbi-gmb.de                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               | https://omero-tim.gerbi-gmb.de                      |
| https://omero-nfdi.uni-muenster.de            | https://omero.nfdi4bioimage.de              | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://omero-nfdi.uni-muenster.de            | https://omero.nfdi4bioimage.de              | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | http://purl.obolibrary.org/obo/T4FS_0000397         |
| https://omero-nfdi.uni-muenster.de            | https://omero.nfdi4bioimage.de              | The Rich OMERO Playground Instance is designed for advanced users, developers, and OMERO administrators who want to test plugins and scripts in a standardized, community-run environment. As a non-production instance built by the community for the community, it serves as a safe playground for experimentation and development. Developers can request admin-level access to the OMERO server and SSH access to the underlying system. To get started, please contact us via the HelpDesk.                                                                                                                                                                                                             |                                                     |
| https://omero-nfdi.uni-muenster.de            | https://omero.nfdi4bioimage.de              | https://omero-nfdi.uni-muenster.de/vkg/sparql                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                | https://omero.nfdi4bioimage.de/vkg/sparql           |
| https://omero-nfdi.uni-muenster.de/vkg/sparql | https://omero.nfdi4bioimage.de/vkg/sparql   | http://www.wikidata.org/entity/Q33002955                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     | http://www.wikidata.org/entity/Q33002955            |
| https://evolomero.evolbio.mpg.de/vkg/sparql   | https://evolomero.evolbio.mpg.de/vkg/sparql | http://www.wikidata.org/entity/Q33002955                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     | http://www.wikidata.org/entity/Q33002955            |
| https://evolomero.evolbio.mpg.de              | https://evolomero.evolbio.mpg.de            | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://evolomero.evolbio.mpg.de              | https://evolomero.evolbio.mpg.de            | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | http://purl.obolibrary.org/obo/T4FS_0000397         |
| https://evolomero.evolbio.mpg.de              | https://evolomero.evolbio.mpg.de            | https://evolomero.evolbio.mpg.de/vkg/sparql                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | https://evolomero.evolbio.mpg.de/vkg/sparql         |
| https://omero-training.gerbi-gmb.de/          | https://omero-training.gerbi-gmb.de/        | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://omero-training.gerbi-gmb.de/          | https://omero-training.gerbi-gmb.de/        | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | http://purl.obolibrary.org/obo/T4FS_0000397         |
| https://omero-training.gerbi-gmb.de/          | https://omero-training.gerbi-gmb.de/        | The OMERO Training Instance is intended for researchers, trainers, and community members who require an OMERO instance for   workshops, demonstrations, training sessions, or presentations. It provides a ready-to-use environment that supports hands-on learning and the practical exploration of image data management workflows. Bonus: you can visit this instance and explore the features of OMERO playfully by going on a treasure hunt.  If you want to use the OMERO Training Instance for your courses, please contact our HelpDesk.                                                                                                                                                             |                                                     |
| https://omero-tim.gerbi-gmb.de                | https://omero-tim.gerbi-gmb.de              | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://omero-tim.gerbi-gmb.de                | https://omero-tim.gerbi-gmb.de              | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | http://purl.obolibrary.org/obo/T4FS_0000397         |
| https://omero-tim.gerbi-gmb.de                | https://omero-tim.gerbi-gmb.de              | The Trends-in-Microscopy (TiM) OMERO Instance is a comprehensive collection of extensively annotated bioimaging datasets acquired using a wide range of microscopy technologies during the biannual TiM community meetings organized by German BioImaging. The datasets have been collaboratively collected, annotated, and curated in accordance with the Recommended Metadata for Biological Images (REMBI) standard. The platform provides a practical example of structured bioimage data management and standardized metadata annotation in biological microscopy. If you are new to OMERO and would like to explore its interface and capabilities, we encourage you to browse the TiM OMERO Instance. |                                                     |

***** sparql update
:PROPERTIES:
:ID:       8c3c2d4d-42d5-4148-8bf5-a2cd5d5dd0a2
:END:
#+begin_src sparql :url http://kg.nfdi4bioimage.de/N4BIKG/sparql :noweb yes :eval no
  <<prefixes>>
  delete {
    graph n4bikg:services {
      ?s ?p ?o .
      }
    }
  insert {
    graph n4bikg:services {
      ?new_s ?p ?new_o .
      }
    }
  where {
    graph n4bikg:services {
      ?s ?p ?o .
      }

    bind(iri(replace(str(?s), "^https://omero-nfdi.uni-muenster.de", "https://omero.nfdi4bioimage.de")) as ?new_s)
    bind(iri(replace(str(?o), "^https://omero-nfdi.uni-muenster.de", "https://omero.nfdi4bioimage.de")) as ?new_o)
         }

#+end_src

***** Confirm
:PROPERTIES:
:ID:       6bc074c5-04d0-4c14-9ecd-39928d6a2c1c
:END:

#+begin_src sparql :url http://kg.nfdi4bioimage.de/N4BIKG/sparql :noweb yes
  <<prefixes>>

  select ?s ?new_s ?o ?new_o where {
    graph n4bikg:services {?s ?p ?o .}
    bind(iri(replace(str(?s), "^https://omero-nfdi.uni-muenster.de", "https://omero.nfdi4bioimage.de")) as ?new_s)
    bind(iri(replace(str(?o), "^https://omero-nfdi.uni-muenster.de", "https://omero.nfdi4bioimage.de")) as ?new_o)
    }
#+end_src

#+RESULTS:
| s                                           | new_s                                       | o                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            | new_o                                               |
|---------------------------------------------+---------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------------------------------------------|
| https://nfdi4bioimage.de/rdf/node           | https://nfdi4bioimage.de/rdf/node           | https://omero-training.gerbi-gmb.de/                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         | https://omero-training.gerbi-gmb.de/                |
| https://nfdi4bioimage.de/rdf/node           | https://nfdi4bioimage.de/rdf/node           | https://omero-tim.gerbi-gmb.de                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               | https://omero-tim.gerbi-gmb.de                      |
| https://nfdi4bioimage.de/rdf/node           | https://nfdi4bioimage.de/rdf/node           | https://omero.nfdi4bioimage.de                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               | https://omero.nfdi4bioimage.de                      |
| https://evolomero.evolbio.mpg.de/vkg/sparql | https://evolomero.evolbio.mpg.de/vkg/sparql | http://www.wikidata.org/entity/Q33002955                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     | http://www.wikidata.org/entity/Q33002955            |
| https://evolomero.evolbio.mpg.de            | https://evolomero.evolbio.mpg.de            | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://evolomero.evolbio.mpg.de            | https://evolomero.evolbio.mpg.de            | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | http://purl.obolibrary.org/obo/T4FS_0000397         |
| https://evolomero.evolbio.mpg.de            | https://evolomero.evolbio.mpg.de            | https://evolomero.evolbio.mpg.de/vkg/sparql                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | https://evolomero.evolbio.mpg.de/vkg/sparql         |
| https://omero-training.gerbi-gmb.de/        | https://omero-training.gerbi-gmb.de/        | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://omero-training.gerbi-gmb.de/        | https://omero-training.gerbi-gmb.de/        | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | http://purl.obolibrary.org/obo/T4FS_0000397         |
| https://omero-training.gerbi-gmb.de/        | https://omero-training.gerbi-gmb.de/        | The OMERO Training Instance is intended for researchers, trainers, and community members who require an OMERO instance for workshops, demonstrations, training sessions, or presentations. It provides a ready-to-use environment that supports hands-on learning and  the practical exploration of image data management workflows.  Bonus: you can visit this instance and explore the features of OMERO playfully by going on a treasure hunt.  If you want to use the OMERO Training Instance for your courses, please contact our HelpDesk.                                                                                                                                                             |                                                     |
| https://omero-tim.gerbi-gmb.de              | https://omero-tim.gerbi-gmb.de              | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://omero-tim.gerbi-gmb.de              | https://omero-tim.gerbi-gmb.de              | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | http://purl.obolibrary.org/obo/T4FS_0000397         |
| https://omero-tim.gerbi-gmb.de              | https://omero-tim.gerbi-gmb.de              | The Trends-in-Microscopy (TiM) OMERO Instance is a comprehensive collection of extensively annotated bioimaging datasets acquired using a wide range of microscopy technologies during the biannual TiM community meetings organized by German BioImaging. The datasets have been collaboratively collected, annotated, and curated in accordance with the Recommended Metadata for Biological Images (REMBI) standard. The platform provides a practical example of structured bioimage data management and standardized metadata annotation in biological microscopy. If you are new to OMERO and would like to explore its interface and capabilities, we encourage you to browse the TiM OMERO Instance. |                                                     |
| https://omero.nfdi4bioimage.de              | https://omero.nfdi4bioimage.de              | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://omero.nfdi4bioimage.de              | https://omero.nfdi4bioimage.de              | http://purl.obolibrary.org/obo/T4FS_0000397                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | http://purl.obolibrary.org/obo/T4FS_0000397         |
| https://omero.nfdi4bioimage.de              | https://omero.nfdi4bioimage.de              | https://omero.nfdi4bioimage.de/vkg/sparql                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    | https://omero.nfdi4bioimage.de/vkg/sparql           |
| https://omero.nfdi4bioimage.de/vkg/sparql   | https://omero.nfdi4bioimage.de/vkg/sparql   | http://www.wikidata.org/entity/Q33002955                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     | http://www.wikidata.org/entity/Q33002955            |



*** DONE rdfs:comment for omero.nfdi4bioimage and evolomero
CLOSED: [2026-06-05 Fri 22:48]
:PROPERTIES:
:ID:       ce77eb64-cf62-4b07-8aeb-20aaa85a6465
:END:
#+begin_src sparql
  prefix n4bikg: <https://kg.nfdi4bioimage.de/n4bikg/>
  PREFIX rdfs:     <http://www.w3.org/2000/01/rdf-schema#>

  insert data {
    graph n4bikg:services {<https://omero.nfdi4bioimage.de> rdfs:comment """The Rich OMERO Playground Instance is designed for advanced users, developers, and OMERO administrators who want to test plugins and scripts in a standardized, community-run environment. As a non-production instance built by the community for the community, it serves as a safe playground for experimentation and development. Developers can request admin-level access to the OMERO server and SSH access to the underlying system.""" .}
    graph n4bikg:services {<https://evolomero.evolbio.mpg.de> rdfs:comment """EvolOMERO is the public OMERO instance at the MPI for Evolutionary Biology. It hosts datasets underlying publications authored by MPI affiliates and other, unpublished data to facilitate sharing with non-MPI collaborators.""" . }
    }
#+end_src

*** DONE omero instances as type T4FS_0000397 .
CLOSED: [2026-06-10 Wed 21:24]
:PROPERTIES:
:ID:       ce77eb64-cf62-4b07-8aeb-20aaa85a6465
:END:
#+begin_src sparql
  prefix n4bikg: <https://kg.nfdi4bioimage.de/n4bikg/>
  PREFIX rdfs:     <http://www.w3.org/2000/01/rdf-schema#>
  prefix obo: <http://purl.obolibrary.org/obo/>

  insert data {
    graph n4bikg:services {<https://omero.nfdi4bioimage.de> a obo:T4FS_0000397 .
                           <https://evolomero.evolbio.mpg.de> a obo:T4FS_0000397 .
                           <https://omero-training.gerbi-gmb.de> a obo:T4FS_0000397 .
                          }
    }
#+end_src

#+begin_src sparql :url http://kg.nfdi4bioimage.de/N4BIKG/query :noweb yes
  <<prefixes>>
  prefix n4bikg: <https://kg.nfdi4bioimage.de/n4bikg/>
  PREFIX rdfs:     <http://www.w3.org/2000/01/rdf-schema#>
  prefix obo: <http://purl.obolibrary.org/obo/>

  select * where {
    ?service a obo:T4FS_0000397 .
    values ?service {<https://omero.nfdi4bioimage.de>}
  ?service a ?service_class .
    service <https://omero.nfdi4bioimage.de/vkg/sparql> {
      ?service a ?remote_service_class .
      }
  }
#+end_src

#+RESULTS:
| service                        | service_class                                       | remote_service_class                            |
|--------------------------------+-----------------------------------------------------+-------------------------------------------------|
| https://omero.nfdi4bioimage.de | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 | https://ld.openmicroscopy.org/omekg/OMEROServer |
| https://omero.nfdi4bioimage.de | http://purl.obolibrary.org/obo/T4FS_0000397         | https://ld.openmicroscopy.org/omekg/OMEROServer |

*** DONE omero instances as type omekg:OMEROServer
CLOSED: [2026-06-11 Thu 09:31]
:PROPERTIES:
:ID:       ce77eb64-cf62-4b07-8aeb-20aaa85a6465
:END:
#+begin_src sparql
  prefix n4bikg: <https://kg.nfdi4bioimage.de/n4bikg/>
  prefix omekg: <https://ld.openmicroscopy.org/omekg/>
  PREFIX rdfs:     <http://www.w3.org/2000/01/rdf-schema#>
  prefix obo: <http://purl.obolibrary.org/obo/>

  insert data {
    graph n4bikg:services {<https://omero.nfdi4bioimage.de> a omekg:OMEROServer .
                           <https://evolomero.evolbio.mpg.de> a omekg:OMEROServer .
                           <https://omero-training.gerbi-gmb.de> a omekg:OMEROServer .
                          }
    }
#+end_src

#+begin_src sparql :url http://kg.nfdi4bioimage.de/N4BIKG/query :noweb yes
  <<prefixes>>
  prefix n4bikg: <https://kg.nfdi4bioimage.de/n4bikg/>
  PREFIX rdfs:     <http://www.w3.org/2000/01/rdf-schema#>
  prefix obo: <http://purl.obolibrary.org/obo/>

  select * where {
    ?service a obo:T4FS_0000397 .
    values ?service {<https://omero.nfdi4bioimage.de>}
  ?service a ?service_class .
    service <https://omero.nfdi4bioimage.de/vkg/sparql> {
      ?service a ?remote_service_class .
      }
  }
#+end_src

#+RESULTS:
| service                        | service_class                                       | remote_service_class                            |
|--------------------------------+-----------------------------------------------------+-------------------------------------------------|
| https://omero.nfdi4bioimage.de | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 | https://ld.openmicroscopy.org/omekg/OMEROServer |
| https://omero.nfdi4bioimage.de | http://purl.obolibrary.org/obo/T4FS_0000397         | https://ld.openmicroscopy.org/omekg/OMEROServer |
| https://omero.nfdi4bioimage.de | https://ld.openmicroscopy.org/core/OMEROServer      | https://ld.openmicroscopy.org/omekg/OMEROServer |
| https://omero.nfdi4bioimage.de | https://ld.openmicroscopy.org/omekg/OMEROServer     | https://ld.openmicroscopy.org/omekg/OMEROServer |

** TODO Services that are not OMERO [0/3]
:PROPERTIES:
:ID:       cfe57251-16e2-4e15-a233-9046a7fed85c
:END:

*** TODO Training Materials
:PROPERTIES:
:ID:       3604ef78-8114-4a3e-b47d-271064213c95
:END:

*** TODO Remote Desktops
:PROPERTIES:
:ID:       161f3c0b-85d3-43f7-a65d-2c9ef4f5de71
:END:

*** TODO Analysis (JPipe, Galaxy, ...)
:PROPERTIES:
:ID:       81df4919-2248-404c-8f4c-8c4bf9e9e6a4
:END:
